/*
 * SV_Motorcode.c
 *
 *  Created on: 2016-1-12
 *      Author: rd0217//
 */
#include "SV_Motorcode.h"
#include "SV_FuncVar.h"
#include "SV_AbsEncode.h"
#include "SV_FaultProtect.h"
#include <string.h>
//此部分表格请用EXCEL生产//


const TYPE_MOTOPARA MotorPara_11_0[6] = {
///*参数内容	*/	/*Pe    Ie		Te	Ue		Ne	Nmax     Pol	Lq		Ld		Rs	 Tk	    Es	 Jm	 Enc	EncLin		ZElcAng	UElcAng	Tun	ABS	ABP	Pq		Pd		Iq		Id*/
/*11030对应参数*/ {    0,    0,     0,    0,     0,      0,   0,     0,      0,      0,    0,    0,    0,  0,      0, 0,  0,     0,   0,  0,  0,     0,      0,      0,      0    }   ,
/*11050对应参数*/ {   10,  100,    32,  220,  3000,   5000,   5,   300,    300,   3920,   68,  675,   30,  4,  32768, 0,  0,  1800,   0,  1,  0,  2000,   2000,   4000,   4000    }   ,
/*11080对应参数*/ {   10,  160,    64,  220,  3000,   5000,   5,   300,    300,   2600,   68,  675,   30,  4,  32768, 0,  0,  1800,   0,  1,  0,  2000,   2000,   4000,   4000    }   ,
/*11100对应参数*/ {   10,  280,   127,  220,  3000,   5000,   5,   560,    560,   2600,   68,  675,   46,  4,  32768, 0,  0,  1800,   0,  1,  0,  2000,   2000,   4000,   4000    }   ,
/*11120对应参数*/ {   15,  460,   239,  220,  3000,   5000,   5,   430,    430,   1160,   68,  675,  140,  4,  32768, 0,  0,  1800,   0,  1,  0,  3000,   3000,   6000,   6000    }   ,
/*11160对应参数*/ {   10,  630,   320,  220,  3000,   5000,   5,   300,    300,   3920,   68,  675,   30,  4,  32768, 0,  0,  1800,   0,  1,  0,  5000,   5000,   9000,   9000    }   ,
};

const TYPE_MOTOPARA MotorPara_11_1[6] = {
///*参数内容	*/	/*Pe    Ie		Te	Ue		Ne	Nmax     Pol	Lq		Ld		Rs	MAXNE	Es	  Jm   Enc	EncLin	ZElcAng	UElcAng	Tun	ABS	ABP	   Pq	   Pd	  Iq	  Id*/
/*11031对应参数*/ {   10,  134,    17,   48,  3000,   4000,   8,   494,    494,    451,   13,   10,    0,   8,  32768,  0,  0,   0,      0,  0,  0,     0,      0,      0,      0    }   ,
/*11051对应参数*/ {   10,  100,    32,  220,  3000,   5000,   5,   300,    300,   3920,   68,  675,   30,   4,  32768,  0,  0,   0,      0,  1,  0,  2000,   2000,   4000,   4000    }   ,
/*11081对应参数*/ {   20,  160,    64,  220,  3000,   5000,   5,   300,    300,   2600,   68,  675,   30,   4,  32768,  0,  0,   0,      0,  1,  0,  2000,   2000,   4000,   4000    }   ,
/*11101对应参数*/ {   40,  280,   127,  220,  3000,   5000,   5,   560,    560,   2600,   68,  675,   46,   4,  32768,  0,  0,   0,      0,  1,  0,  2000,   2000,   4000,   4000    }   ,
/*11121对应参数*/ {   75,  460,   239,  220,  3000,   5000,   5,   430,    430,   1160,   68,  675,  140,   4,  32768,  0,  0,   0,      0,  1,  0,  3000,   3000,   6000,   6000    }   ,
/*11161对应参数*/ {  100,  630,   320,  220,  3000,   5000,   5,   300,    300,   3920,   68,  675,   30,   4,  32768,  0,  0,   0,      0,  1,  0,  5000,   5000,   9000,   9000    }   ,
};

//MAX 5.7A
const TYPE_MOTOPARA MotorPara_14_0[6] = {
///*参数内容	*/	/*Pe    Ie		Te	 Ue		Ne	 Nmax     Pol	Lq		Ld		Rs	MAXNE	Es	  Jm   Enc	EncLin	  ZElcAng	UElcAng	 Tun ABS  ABP	Pq	   Pd	  Iq	  Id    Keq   Ked  Keq1  Reduce */
/*14030对应参数*/ {   10,  255,    32,   48,  3000,   3500,   8,   179,    179,    193, 2500,  800,   10,   8,  32768,  0,  300,      0,      0,  0,  0,  4187,   4187,   7019,   7019,  100, 100, 100,    80 }, 
/*14050对应参数*/ {   10,  134,    17,   48,  3000,   3500,   8,   179,    179,    193, 3000,  800,   10,   8,  32768,  0,  300,      0,      0,  0,  0,  4187,   4187,   7019,   7019,  100, 100, 100,    50 },
/*14080对应参数*/ {   10,  131,    16,   48,  3000,   3500,   8,   179,    179,    193, 3000,  800,   10,   8,  32768,  0,  300,      0,      0,  0,  0,  4187,   4187,   7019,   7019,  100, 100, 100,    80 },
/*14100对应参数*/ {   10,  105,    13,   48,  3000,   3500,   8,   179,    179,    193, 3000,  800,   10,   8,  32768,  0,  300,      0,      0,  0,  0,  4187,   4187,   7019,   7019,  100, 100, 100,   100 },
/*14120对应参数*/ {   10,    0,    19,   48,  3000,   3500,   8,   179,    179,    193, 3000,  800,   10,   8,  32768,  0,  300,      0,      0,  0,  0,  4187,   4187,   7019,   7019,  100, 100, 100,   100 },
/*14160对应参数*/ {   10,    0,    19,   48,  3000,   3500,   8,   179,    179,    193, 3000,  800,   10,   8,  32768,  0,  300,      0,      0,  0,  0,  4187,   4187,   7019,   7019,  100, 100, 100,   100 },
};

//MAX 5.7A
const TYPE_MOTOPARA MotorPara_14_1[6] = {
///*参数内容	*/	/*Pe    Ie		Te	 Ue		Ne	 Nmax     Pol	Lq		Ld		Rs	MAXNE	Es	  Jm   Enc	EncLin	  ZElcAng	UElcAng	 Tun ABS  ABP	Pq	   Pd	  Iq	  Id    Keq   Ked  Keq1  Reduce */
/*14031对应参数*/ {   10,  255,    32,   48,  3000,   3500,   8,   179,    179,    193, 2500,  800,   10,   8,  32768,  0,  300,      0,      0,  0,  0,  4187,   4187,   7019,   7019,  100, 100, 100,    81 }, 
/*14051对应参数*/ {   10,  134,    17,   48,  3000,   3500,   8,   179,    179,    193, 3000,  800,   10,   8,  32768,  0,  300,      0,      0,  0,  0,  4187,   4187,   7019,   7019,  100, 100, 100,    51 },
/*14081对应参数*/ {   10,  131,    16,   48,  3000,   3500,   8,   179,    179,    193, 3000,  800,   10,   8,  32768,  0,  300,      0,      0,  0,  0,  4187,   4187,   7019,   7019,  100, 100, 100,    81 },
/*14101对应参数*/ {   10,  105,    13,   48,  3000,   3500,   8,   179,    179,    193, 3000,  800,   10,   8,  32768,  0,  300,      0,      0,  0,  0,  4187,   4187,   7019,   7019,  100, 100, 100,   101 },
/*14121对应参数*/ {   10,    0,    19,   48,  3000,   3500,   8,   179,    179,    193, 3000,  800,   10,   8,  32768,  0,  300,      0,      0,  0,  0,  4187,   4187,   7019,   7019,  100, 100, 100,   101 },
/*14161对应参数*/ {   10,    0,    19,   48,  3000,   3500,   8,   179,    179,    193, 3000,  800,   10,   8,  32768,  0,  300,      0,      0,  0,  0,  4187,   4187,   7019,   7019,  100, 100, 100,   101 },
};

//MAX 15.1A
const TYPE_MOTOPARA MotorPara_17_0[6] = {
///*参数内容	*/	/*Pe    Ie		Te	 Ue		Ne	 Nmax     Pol	Lq		Ld		Rs	MAXNE	Es	  Jm   Enc	EncLin	  ZElcAng	UElcAng	 Tun ABS  ABP	Pq	   Pd	  Iq	  Id    Keq   Ked  Keq1  Reduce */
/*17030对应参数*/ {   15,  420,    45,   48,  3000,   4000,   8,   497,    497,    510, 2500,  710,   14,   8,  32768,  0,  300,      0,      0,  0,  0,  2300,   2300,   4300,   4300,  100, 100, 100,    80 }, 
/*17050对应参数*/ {   15,  420,    45,   48,  3000,   4000,   8,   497,    497,    510, 3000,  710,   14,   8,  32768,  0,  300,      0,      0,  0,  0,  2300,   2300,   4300,   4300,  100, 100, 100,    50 },
/*17080对应参数*/ {   15,  380,    41,   48,  3000,   4000,   8,   497,    497,    510, 3000,  710,   14,   8,  32768,  0,  300,      0,      0,  0,  0,  2300,   2300,   4300,   4300,  100, 100, 100,    80 },
/*17100对应参数*/ {   15,  420,    45,   48,  3000,   4000,   8,   497,    497,    510, 3000,  710,   14,   8,  32768,  0,  300,      0,      0,  0,  0,  2300,   2300,   4300,   4300,  100, 100, 100,   100 },
/*17120对应参数*/ {   15,  370,    40,   48,  3000,   4000,   8,   497,    497,    510, 3000,  710,   14,   8,  32768,  0,  300,      0,      0,  0,  0,  2300,   2300,   4300,   4300,  100, 100, 100,   120 },
/*17160对应参数*/ {   15,    0,    19,   48,  3000,   4000,   8,   497,    497,    510, 3000,  710,   14,   8,  32768,  0,  300,      0,      0,  0,  0,  2300,   2300,   4300,   4300,  100, 100, 100,   160 },
};

//MAX 15.1A
const TYPE_MOTOPARA MotorPara_17_1[6] = {
///*参数内容	*/	/*Pe    Ie		Te	 Ue		Ne	 Nmax     Pol	Lq		Ld		Rs	MAXNE	Es	  Jm   Enc	EncLin	  ZElcAng	UElcAng	 Tun ABS  ABP	Pq	   Pd	  Iq	  Id    Keq   Ked  Keq1  Reduce */
/*17031对应参数*/ {   15,  420,    45,   48,  3000,   4000,   8,   497,    497,    510, 2500,  710,   14,   8,  32768,  0,  300,      0,      0,  0,  0,  2300,   2300,   4300,   4300,  100, 100, 100,    81 }, 
/*17051对应参数*/ {   15,  420,    45,   48,  3000,   4000,   8,   497,    497,    510, 3000,  710,   14,   8,  32768,  0,  300,      0,      0,  0,  0,  2300,   2300,   4300,   4300,  100, 100, 100,    51 },
/*17081对应参数*/ {   15,  380,    41,   48,  3000,   4000,   8,   497,    497,    510, 3000,  710,   14,   8,  32768,  0,  300,      0,      0,  0,  0,  2300,   2300,   4300,   4300,  100, 100, 100,    81 },
/*17101对应参数*/ {   15,  420,    45,   48,  3000,   4000,   8,   497,    497,    510, 3000,  710,   14,   8,  32768,  0,  300,      0,      0,  0,  0,  2300,   2300,   4300,   4300,  100, 100, 100,   101 },
/*17121对应参数*/ {   15,  370,    40,   48,  3000,   4000,   8,   497,    497,    510, 3000,  710,   14,   8,  32768,  0,  300,      0,      0,  0,  0,  2300,   2300,   4300,   4300,  100, 100, 100,   121 },
/*17161对应参数*/ {   15,    0,    19,   48,  3000,   4000,   8,   497,    497,    510, 3000,  710,   14,   8,  32768,  0,  300,      0,      0,  0,  0,  2300,   2300,   4300,   4300,  100, 100, 100,   161 },
};

//MAX 22.6A
const TYPE_MOTOPARA MotorPara_20_0[6] = {
///*参数内容	*/	/*Pe    Ie		Te	 Ue		Ne	 Nmax     Pol	Lq		Ld		Rs	MAXNE	Es	  Jm   Enc	EncLin	  ZElcAng	UElcAng	 Tun ABS  ABP	Pq	   Pd	  Iq	  Id    Keq   Ked  Keq1  Reduce */
/*20030对应参数*/ {   31,  765,   100,   48,  3000,   3500,   8,   800,    800,    310, 2500,  840,   52,   8,  32768,  0,  300,      0,      0,  0,  0,  3300,   3300,   2600,   2600,  100, 100, 100,    80 }, 
/*20050对应参数*/ {   31,  630,    82,   48,  3000,   3500,   8,   800,    800,    310, 2900,  840,   52,   8,  32768,  0,  300,      0,      0,  0,  0,  3300,   3300,   2600,   2600,  100, 100, 100,    50 },
/*20080对应参数*/ {   31,  550,    72,   48,  3000,   3500,   8,   800,    800,    310, 2700,  840,   52,   8,  32768,  0,  300,      0,      0,  0,  0,  3300,   3300,   2600,   2600,  100, 100, 100,    80 },
/*20100对应参数*/ {   31,  460,    60,   48,  3000,   3500,   8,   800,    800,    310, 3000,  840,   52,   8,  32768,  0,  300,      0,      0,  0,  0,  3300,   3300,   2600,   2600,  100, 100, 100,   100 },
/*20120对应参数*/ {   31,  385,    50,   48,  3000,   3500,   8,   800,    800,    310, 3000,  840,   52,   8,  32768,  0,  300,      0,      0,  0,  0,  3300,   3300,   2600,   2600,  100, 100, 100,   120 },
/*20160对应参数*/ {   31,    0,    19,   48,  3000,   3500,   8,   800,    800,    310, 3000,  840,   52,   8,  32768,  0,  300,      0,      0,  0,  0,  3300,   3300,   2600,   2600,  100, 100, 100,   160 },
};

//MAX 22.6A
const TYPE_MOTOPARA MotorPara_20_1[6] = {
///*参数内容	*/	/*Pe    Ie		Te	 Ue		Ne	 Nmax     Pol	Lq		Ld		Rs	MAXNE	Es	  Jm   Enc	EncLin	  ZElcAng	UElcAng	 Tun ABS  ABP	Pq	   Pd	  Iq	  Id    Keq   Ked  Keq1  Reduce */
/*20001对应参数*/ {   31,  765,   100,   48,  3000,   3500,   8,   800,    800,    310, 2500,  840,   52,   8,  32768,  0,  300,      0,      0,  0,  0,  3300,   3300,   2600,   2600,  100, 100, 100,   101 }, 
/*20051对应参数*/ {   31,  630,    82,   48,  3000,   3500,   8,   800,    800,    310, 2900,  840,   52,   8,  32768,  0,  300,      0,      0,  0,  0,  3300,   3300,   2600,   2600,  100, 100, 100,    51 },
/*20081对应参数*/ {   31,  550,    72,   48,  3000,   3500,   8,   800,    800,    310, 2700,  840,   52,   8,  32768,  0,  300,      0,      0,  0,  0,  3300,   3300,   2600,   2600,  100, 100, 100,    81 },
/*20101对应参数*/ {   31,  460,    60,   48,  3000,   3500,   8,   800,    800,    310, 3000,  840,   52,   8,  32768,  0,  300,      0,      0,  0,  0,  3300,   3300,   2600,   2600,  100, 100, 100,   101 },
/*20121对应参数*/ {   31,  385,    50,   48,  3000,   3500,   8,   800,    800,    310, 3000,  840,   52,   8,  32768,  0,  300,      0,      0,  0,  0,  3300,   3300,   2600,   2600,  100, 100, 100,   121 },
/*20161对应参数*/ {   31,    0,    19,   48,  3000,   3500,   8,   800,    800,    310, 3000,  840,   52,   8,  32768,  0,  300,      0,      0,  0,  0,  3300,   3300,   2600,   2600,  100, 100, 100,   161 },
};

//MAX 45.26A
const TYPE_MOTOPARA MotorPara_25_0[6] = {
///*参数内容	*/	/*Pe    Ie		Te	 Ue		Ne	 Nmax     Pol	Lq		Ld		Rs	MAXNE	Es	  Jm   Enc	EncLin	  ZElcAng	UElcAng	 Tun ABS  ABP	Pq	   Pd	  Iq	  Id    Keq   Ked  Keq1  Reduce */
/*25030对应参数*/ {   63, 1620,   200,   48,  3000,   3500,   8,   220,    220,    120, 2500,  790,  114,   8,  32768,  0,  300,      0,      0,  1,  0,  2300,   2300,   4300,   4300,  100, 100, 100,   120 }, 
/*25050对应参数*/ {   63, 1080,   133,   48,  3000,   3500,   8,   220,    220,    120, 3000,  790,  114,   8,  32768,  0,  300,      0,      0,  1,  0,  2300,   2300,   4300,   4300,  100, 100, 100,    50 },
/*25080对应参数*/ {   63, 1070,   132,   48,  3000,   3500,   8,   220,    220,    120, 3000,  790,  114,   8,  32768,  0,  300,      0,      0,  1,  0,  2300,   2300,   4300,   4300,  100, 100, 100,    80 },
/*25100对应参数*/ {   63, 1067,   132,   48,  3000,   3500,   8,   220,    220,    120, 2700,  790,  114,   8,  32768,  0,  300,      0,      0,  1,  0,  2300,   2300,   4300,   4300,  100, 100, 100,   100 },
/*25120对应参数*/ {   63,  890,   110,   48,  3000,   3500,   8,   220,    220,    120, 2800,  790,  114,   8,  32768,  0,  300,      0,      0,  1,  0,  2300,   2300,   4300,   4300,  100, 100, 100,   120 },
/*25160对应参数*/ {   63,    0,    19,   48,  3000,   3500,   8,   220,    220,    120, 3000,  790,  114,   8,  32768,  0,  300,      0,      0,  1,  0,  2300,   2300,   4300,   4300,  100, 100, 100,   160 },
};

//MAX 45.26A
const TYPE_MOTOPARA MotorPara_25_1[6] = {
///*参数内容	*/	/*Pe    Ie		Te	 Ue		Ne	 Nmax     Pol	Lq		Ld		Rs	MAXNE	Es	  Jm   Enc	EncLin	  ZElcAng	UElcAng	 Tun ABS  ABP	Pq	   Pd	  Iq	  Id    Keq   Ked  Keq1  Reduce */
/*25031对应参数*/ {   63, 1620,   200,   48,  3000,   3500,   8,   220,    220,    120, 2500,  790,  114,   8,  32768,  0,  300,      0,      0,  1,  0,  2300,   2300,   4300,   4300,  100, 100, 100,   121 }, 
/*25051对应参数*/ {   63, 1080,   133,   48,  3000,   3500,   8,   220,    220,    120, 3000,  790,  114,   8,  32768,  0,  300,      0,      0,  1,  0,  2300,   2300,   4300,   4300,  100, 100, 100,    51 },
/*25081对应参数*/ {   63, 1070,   132,   48,  3000,   3500,   8,   220,    220,    120, 3000,  790,  114,   8,  32768,  0,  300,      0,      0,  1,  0,  2300,   2300,   4300,   4300,  100, 100, 100,    81 },
/*25101对应参数*/ {   63, 1067,   132,   48,  3000,   3500,   8,   220,    220,    120, 2700,  790,  114,   8,  32768,  0,  300,      0,      0,  1,  0,  2300,   2300,   4300,   4300,  100, 100, 100,   101 },
/*25121对应参数*/ {   63,  890,   110,   48,  3000,   3500,   8,   220,    220,    120, 2800,  790,  114,   8,  32768,  0,  300,      0,      0,  1,  0,  2300,   2300,   4300,   4300,  100, 100, 100,   121 },
/*25161对应参数*/ {   63,  890,   110,   48,  3000,   3500,   8,   220,    220,    120, 2800,  790,  114,   8,  32768,  0,  300,      0,      0,  1,  0,  2300,   2300,   4300,   4300,  100, 100, 100,   161 },
};

//MAX 45.26A
const TYPE_MOTOPARA MotorPara_32_0[6] = {
///*参数内容	*/	/*Pe    Ie		Te	 Ue		Ne	 Nmax     Pol	Lq		Ld		Rs	MAXNE	Es	  Jm   Enc	EncLin	  ZElcAng	UElcAng	 Tun ABS  ABP	Pq	   Pd	  Iq	  Id    Keq   Ked  Keq1  Reduce */
/*32000对应参数*/ {   90, 2400,   360,   48,  2000,   2800,   8,   182,    182,     49, 1600,  972,  446,   8,  32768,  0,  300,      0,      0,  1,  0,  3000,   3000,   2000,   2000,  100, 100, 100,   120 }, 
/*32050对应参数*/ {   90, 1740,   261,   48,  2000,   2800,   8,   182,    182,     49, 2300,  972,  446,   8,  32768,  0,  300,      0,      0,  1,  0,  3000,   3000,   2000,   2000,  100, 100, 100,    50 },
/*32080对应参数*/ {   90, 1700,   254,   48,  2000,   2800,   8,   182,    182,     49, 2400,  972,  446,   8,  32768,  0,  300,      0,      0,  1,  0,  3000,   3000,   2000,   2000,  100, 100, 100,    80 },
/*32100对应参数*/ {   90, 1770,   264,   48,  2000,   2800,   8,   182,    182,     49, 2300,  972,  446,   8,  32768,  0,  300,      0,      0,  1,  0,  3000,   3000,   2000,   2000,  100, 100, 100,   100 },
/*32120对应参数*/ {   90, 1470,   221,   48,  2000,   2800,   8,   182,    182,     49, 2700,  972,  446,   8,  32768,  0,  300,      0,      0,  1,  0,  3000,   3000,   2000,   2000,  100, 100, 100,   120 },
/*32160对应参数*/ {   90, 1470,   221,   48,  2000,   2800,   8,   182,    182,     49, 2700,  972,  446,   8,  32768,  0,  300,      0,      0,  1,  0,  3000,   3000,   2000,   2000,  100, 100, 100,   160 },
};

//MAX 45.26A
const TYPE_MOTOPARA MotorPara_32_1[6] = {
///*参数内容	*/	/*Pe    Ie	  Te	 Ue		Ne	  Nmax    Pol	Lq		Ld		Rs	MAXNE	Es	  Jm   Enc	EncLin	  ZElcAng	UElcAng	 Tun ABS  ABP	Pq	   Pd	  Iq	  Id    Keq   Ked  Keq1  Reduce */
/*32001对应参数*/ {   90, 2400,   360,   48,  2000,   2800,   8,   182,    182,     49, 1600,  972,  446,   8,  32768,  0,  300,      0,      0,  1,  0,  3000,   3000,   2000,   2000,  100, 100, 100,   121 }, 
/*32051对应参数*/ {   90, 1740,   261,   48,  2000,   2800,   8,   182,    182,     49, 2300,  972,  446,   8,  32768,  0,  300,      0,      0,  1,  0,  3000,   3000,   2000,   2000,  100, 100, 100,    51 },
/*32081对应参数*/ {   90, 1700,   254,   48,  2000,   2800,   8,   182,    182,     49, 2400,  972,  446,   8,  32768,  0,  300,      0,      0,  1,  0,  3000,   3000,   2000,   2000,  100, 100, 100,    81 },
/*32101对应参数*/ {   90, 1770,   264,   48,  2000,   2800,   8,   182,    182,     49, 2300,  972,  446,   8,  32768,  0,  300,      0,      0,  1,  0,  3000,   3000,   2000,   2000,  100, 100, 100,   101 },
/*32121对应参数*/ {   90, 1470,   221,   48,  2000,   2800,   8,   182,    182,     49, 2700,  972,  446,   8,  32768,  0,  300,      0,      0,  1,  0,  3000,   3000,   2000,   2000,  100, 100, 100,   121 },
/*32161对应参数*/ {   90, 1470,   221,   48,  2000,   2800,   8,   182,    182,     49, 2700,  972,  446,   8,  32768,  0,  300,      0,      0,  1,  0,  3000,   3000,   2000,   2000,  100, 100, 100,   161 },
};

void MotoParaInit (Uint16 code)
{
	TYPE_MOTOPARA tmpPara;
    TYPE_MOTOPARA tmpPara1;
    
	memcpy(&tmpPara, &RamMotor->Pe, sizeof(TYPE_MOTOPARA));
    memcpy(&tmpPara1, &RamMotor->Pe, sizeof(TYPE_MOTOPARA));
    
	if(0 == code)		//如果读取到的电机代码为0则从功能码值PE-01设定的电机代码获取参数
	{
		code = RamMotor->MotorCode;
	}
	else
	{
		RamMotor->MotorCode = EncInfo.ReadMotorcode;//驱动器代码赋值
	}
    
	if(0 != code)	//code不为0，从codeTable中读取
	{
		switch(code)
		{
            case 14001:
                memcpy(&tmpPara, &MotorPara_14_1[0], sizeof(TYPE_MOTOPARA));
            break;
            case 14051:
                memcpy(&tmpPara, &MotorPara_14_1[1], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 14081:
                memcpy(&tmpPara, &MotorPara_14_1[2], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 14101:
                memcpy(&tmpPara, &MotorPara_14_1[3], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 14121:
                memcpy(&tmpPara, &MotorPara_14_1[4], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            
            case 17001:
                memcpy(&tmpPara, &MotorPara_17_1[0], sizeof(TYPE_MOTOPARA));
            break;
            case 17051:
                memcpy(&tmpPara, &MotorPara_17_1[1], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 17081:
                memcpy(&tmpPara, &MotorPara_17_1[2], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 17101:
                memcpy(&tmpPara, &MotorPara_17_1[3], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 17121:
                memcpy(&tmpPara, &MotorPara_17_1[4], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;  
            
            case 20001:
                memcpy(&tmpPara, &MotorPara_20_1[0], sizeof(TYPE_MOTOPARA));
            break;
            case 20051:
                memcpy(&tmpPara, &MotorPara_20_1[1], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 20081:
                memcpy(&tmpPara, &MotorPara_20_1[2], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 20101:
                memcpy(&tmpPara, &MotorPara_20_1[3], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 20121:
                memcpy(&tmpPara, &MotorPara_20_1[4], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 20161:
                memcpy(&tmpPara, &MotorPara_20_1[5], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;

            case 25001:
                memcpy(&tmpPara, &MotorPara_25_1[0], sizeof(TYPE_MOTOPARA));
            break;
            case 25051:
                memcpy(&tmpPara, &MotorPara_25_1[1], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 25081:
                memcpy(&tmpPara, &MotorPara_25_1[2], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 25101:
                memcpy(&tmpPara, &MotorPara_25_1[3], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 25121:
                memcpy(&tmpPara, &MotorPara_25_1[4], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 25161:
                memcpy(&tmpPara, &MotorPara_25_1[5], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            
            case 32001:
                memcpy(&tmpPara, &MotorPara_32_1[0], sizeof(TYPE_MOTOPARA));
            break;
            case 32051:
                memcpy(&tmpPara, &MotorPara_32_1[1], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 32081:
                memcpy(&tmpPara, &MotorPara_32_1[2], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 32101:
                memcpy(&tmpPara, &MotorPara_32_1[3], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 32121:
                memcpy(&tmpPara, &MotorPara_32_1[4], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            case 32161:
                memcpy(&tmpPara, &MotorPara_32_1[5], sizeof(TYPE_MOTOPARA));
                RamPD->Reduction = tmpPara.Reduction;
            break;
            
            default:
            FaultPrtt_FaultInterface(DrvMotPaErr);
            break;
		}
	}

	if(tmpPara.EncLineL == 0 && tmpPara.EncLineH == 0)	//当前code不存在，保持之前值
	{
		FaultPrtt_FaultInterface(DrvMotPaErr);
	}
	else//CODE正常，赋值
	{
        tmpPara.EncType = tmpPara1.EncType;
        tmpPara.ZeroElecAngle = tmpPara1.ZeroElecAngle;
		memcpy(&RamMotor->Pe,&tmpPara,sizeof(TYPE_MOTOPARA));
	}
    
    {
        Uint32 MaxTorM,MaxTorS;
        
        MaxTorM = RamMotor->Ie * RamMotor->TrqConst / 10;
        MaxTorS = RamServo->ServoIe * RamServo->IeSampleGain;
        
        if(MaxTorM > MaxTorS)
        {
            FaultPrtt_FaultInterface(DrvMotPaErr);  
        }   
    }

	if((RamMotor->ABSEnc == 0)||(RamAid->AbsType==0))//作单圈用
	{
		RamServo->MASK_E19 = 1;//多圈故障屏蔽
		RamServo->MASK_E1A = 1;
	}//2019.6.1加入默认为多圈值电机，使用Pr8.28=0也可以屏蔽多圈故障，用户更方便使用，也兼容以前参数设置

//    if((RamMotor->ABSEnc == 1)&&(RamAid->AbsType==0))//作单圈用
//    {
//        FaultPrtt_FaultInterface(ABSErr);
//    }
}

